package org.itstep.qa;

import java.util.Arrays;
import java.util.Random;
import java.util.Scanner;

// Обьявить массив целых чисел длинной 10 элементов
// Ввести значение для элементов массива с клавиатуры
// Вывести массив на экран.
public class Zadanie {
    public static void main(String[] args) {
        int array[];
        array = new int[10];
        Scanner array = new Scanner(System.in);
        array = nextInt();
        System.out.println(array);
    }
}
